IdeaRS.Connections
ItemOrientation Enumeration
Compatible with IDEA StatiCa 0.0
 It represents orientation of the plate (or any other item) relative to its reference member
 Namespace: IdeaRS.Connections.Data
 Assembly: IdeaRS.Connections (in IdeaRS.Connections.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public enum ItemOrientation
Members
Member name | Value | Description
Perpendicular | 0 |  Perpendicular
Horizontal | 1 |  Horizonatal
Vertical | 2 |  Vertical
Custom | 3 |  Custom
See Also
Reference
IdeaRS.Connections.Data Namespace